#include<stdio.h>

void interface_reader()
{
    printf("================================================\n");
    printf("=               图书信息管理系统               =\n");
    printf("=----------------------------------------------=\n");
    printf("=                 - 读者菜单 -                 =\n");
    printf("=                                              =\n");
    printf("=                1.浏览图书信息                =\n");
    printf("=                2.查询图书信息                =\n");
    printf("=                3.借阅图书信息                =\n");
    printf("=                4.归还图书信息                =\n");
    printf("=                5.我的借阅信息                =\n");
    printf("=                0.退出系统                    =\n");
    printf("=                                              =\n");
    printf("================================================\n");
}

void interface_manager()
{
    printf("================================================\n");
    printf("=               图书信息管理系统               =\n");
    printf("=----------------------------------------------=\n");
    printf("=                - 管理员菜单 -                =\n");
    printf("=                                              =\n");
    printf("=                1.添加图书信息                =\n");
    printf("=                2.修改图书信息                =\n");
    printf("=                3.删除图书信息                =\n");
    printf("=                4.浏览图书信息                =\n");
    printf("=                5.查询图书信息                =\n");
    printf("=                6.排序图书信息                =\n");
    printf("=                7.统计图书信息                =\n");
    printf("=                0.退出系统                    =\n");
    printf("=                                              =\n");
    printf("================================================\n");
}

void interface_login()
{
    printf("================================================\n");
    printf("=               图书信息管理系统               =\n");
    printf("=----------------------------------------------=\n");
    printf("=                 - 欢迎使用 -                 =\n");
    printf("=                                              =\n");
    printf("=                  1.用户登陆                  =\n");
    printf("=                  2.用户注册                  =\n");
    printf("=                  0.退出系统                  =\n");
    printf("=                                              =\n");
    printf("================================================\n");
}

void interface_end()
{
    //显示结束语
    printf("================================================\n");
    printf("=               图书信息管理系统               =\n");
    printf("=----------------------------------------------=\n");
    printf("=               - 欢迎下次使用 -               =\n");
    printf("================================================\n");
}
